# 전국 신규 민간 아파트 분양가격 동향

## 데이터 로드

In [3]:
# 2013년 9월 ~ 2015년 8월 데이터

import pandas as pd

# encoding = "cp949" 로도 가능
df1 = pd.read_csv("./resources/13.09_15.8.csv", encoding="euc-kr")

In [9]:
# 15.10 ~ 2019.12 까지 데이터

df2 = pd.read_csv("./resources/2002.csv", encoding="cp949")

## 데이터 확인하기

### df1

In [4]:
# 데이터 셋 (행,열) 확인

df1.shape

(17, 22)

In [6]:
# 앞쪽의 5개 데이터 확인

df1.head()

,지역,2013년12월,2014년1월,2014년2월,2014년3월,2014년4월,2014년5월,2014년6월,2014년7월,2014년8월,...,2014년11월,2014년12월,2015년1월,2015년2월,2015년3월,2015년4월,2015년5월,2015년6월,2015년7월,2015년8월
0,서울,18189,17925,17925,18016,18098,19446,18867,18742,19274,...,20242,20269,20670,20670,19415,18842,18367,18374,18152,18443
1,부산,8111,8111,9078,8965,9402,9501,9453,9457,9411,...,9208,9208,9204,9235,9279,9327,9345,9515,9559,9581
2,대구,8080,8080,8077,8101,8267,8274,8360,8360,8370,...,8439,8253,8327,8416,8441,8446,8568,8542,8542,8795
3,인천,10204,10204,10408,10408,10000,9844,10058,9974,9973,...,10020,10020,10017,9876,9876,9938,10551,10443,10443,10449
4,광주,6098,7326,7611,7346,7346,7523,7659,7612,7622,...,7752,7748,7752,7756,7861,7914,7877,7881,8089,8231

In [7]:
df1.tail()

,지역,2013년12월,2014년1월,2014년2월,2014년3월,2014년4월,2014년5월,2014년6월,2014년7월,2014년8월,...,2014년11월,2014년12월,2015년1월,2015년2월,2015년3월,2015년4월,2015년5월,2015년6월,2015년7월,2015년8월
12,전북,6282,6281,5946,5966,6277,6306,6351,6319,6436,...,6583,6583,6583,6583,6542,6551,6556,6601,6750,6580
13,전남,5678,5678,5678,5696,5736,5656,5609,5780,5685,...,5768,5784,5784,5833,5825,5940,6050,6243,6286,6289
14,경북,6168,6168,6234,6317,6412,6409,6554,6556,6563,...,6881,6989,6992,6953,6997,7006,6966,6887,7035,7037
15,경남,6473,6485,6502,6610,6599,6610,6615,6613,6606,...,7125,7332,7592,7588,7668,7683,7717,7715,7723,7665
16,제주,7674,7900,7900,7900,7900,7900,7914,7914,7914,...,7724,7739,7739,7739,7826,7285,7285,7343,7343,7343

In [16]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17 entries, 0 to 16
Data columns (total 22 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   지역        17 non-null     object
 1   2013년12월  17 non-null     int64
 2   2014년1월   17 non-null     int64
 3   2014년2월   17 non-null     int64
 4   2014년3월   17 non-null     int64
 5   2014년4월   17 non-null     int64
 6   2014년5월   17 non-null     int64
 7   2014년6월   17 non-null     int64
 8   2014년7월   17 non-null     int64
 9   2014년8월   17 non-null     int64
 10  2014년9월   17 non-null     int64
 11  2014년10월  17 non-null     int64
 12  2014년11월  17 non-null     int64
 13  2014년12월  17 non-null     int64
 14  2015년1월   17 non-null     int64
 15  2015년2월   17 non-null     int64
 16  2015년3월   17 non-null     int64
 17  2015년4월   17 non-null     int64
 18  2015년5월   17 non-null     int64
 19  2015년6월   17 non-null     int64
 20  2015년7월   17 non-null     int64
 21  2015년8월   17 non-null     int64
dtypes: int64(21), object(1)
memory usage: 3.0+ KB

### df2

In [10]:
# 데이터 셋 (행,열) 확인

df2.shape

(4505, 5)

In [14]:
# 앞쪽의 5개 데이터 확인

df2.head()

  지역명               규모구분    연도   월 분양가격(㎡)
0  서울                 전체  2015  10    5841
1  서울         전용면적 60㎡이하  2015  10    5652
2  서울   전용면적 60㎡초과 85㎡이하  2015  10    5882
3  서울  전용면적 85㎡초과 102㎡이하  2015  10    5721
4  서울        전용면적 102㎡초과  2015  10    5879

In [13]:
df2.tail()

     지역명               규모구분    연도  월 분양가격(㎡)
4500  제주                 전체  2020  2    3955
4501  제주         전용면적 60㎡이하  2020  2    4039
4502  제주   전용면적 60㎡초과 85㎡이하  2020  2    3962
4503  제주  전용면적 85㎡초과 102㎡이하  2020  2     NaN
4504  제주        전용면적 102㎡초과  2020  2    3601

In [17]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4505 entries, 0 to 4504
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   지역명      4505 non-null   object
 1   규모구분     4505 non-null   object
 2   연도       4505 non-null   int64
 3   월        4505 non-null   int64
 4   분양가격(㎡)  4210 non-null   object
dtypes: int64(2), object(3)
memory usage: 176.1+ KB

## 데이터 전처리 - df2

In [25]:
# 데이터 타입 확인
df2["분양가격(㎡)"]

0       5841
1       5652
2       5882
3       5721
4       5879
        ...
4500    3955
4501    4039
4502    3962
4503     NaN
4504    3601
Name: 분양가격(㎡), Length: 4505, dtype: object

* 분양가격 컬럼이 object 타입이라는 걸 알게 됨
* 가격이기 때문에 나중을 위해 수치로 변환한는 것 필요

In [26]:
# 데이터 타입 변경

df2['분양가격(㎡)'].astype(int)

ValueError: invalid literal for int() with base 10: '  '

In [27]:
# 수치로 변환하는 두번째 방법인 to_numeric 를 사용해도 에러남

pd.to_numeric(df2['분양가격(㎡)'])

ValueError: Unable to parse string "  " at position 28

<b>공백이 있기 때문에 어느 걸 사용해도 에러남</b>

* astype(int) => ValueError: invalid literal for int() with base 10: '  ' 
* to_numeric() => ValueError: Unable to parse string "  " at position 28

In [28]:
# 공백이 어느 정도 존재하는지 알기 위해서 결측치 보기를 하기
# 결측치 보기 (True :1, False : 0)

df2.isnull()

        지역명   규모구분     연도      월  분양가격(㎡)
0     False  False  False  False    False
1     False  False  False  False    False
2     False  False  False  False    False
3     False  False  False  False    False
4     False  False  False  False    False
...     ...    ...    ...    ...      ...
4500  False  False  False  False    False
4501  False  False  False  False    False
4502  False  False  False  False    False
4503  False  False  False  False     True
4504  False  False  False  False    False

[4505 rows x 5 columns]

In [20]:
# 결측치 전체 개수 구하기

df2.isnull().sum()

지역명          0
규모구분         0
연도           0
월            0
분양가격(㎡)    295
dtype: int64

In [21]:
# 결측치를 구하는 또 다른 방법

df2.isna()

        지역명   규모구분     연도      월  분양가격(㎡)
0     False  False  False  False    False
1     False  False  False  False    False
2     False  False  False  False    False
3     False  False  False  False    False
4     False  False  False  False    False
...     ...    ...    ...    ...      ...
4500  False  False  False  False    False
4501  False  False  False  False    False
4502  False  False  False  False    False
4503  False  False  False  False     True
4504  False  False  False  False    False

[4505 rows x 5 columns]

In [24]:
# 결측치를 구한 후 합계 내기

df2.isna().sum()

지역명          0
규모구분         0
연도           0
월            0
분양가격(㎡)    295
dtype: int64

In [29]:
# to_numberic() 를 사용하되 옵션을 넣어서 공백을 무시하도록 하기

pd.to_numeric(df2["분양가격(㎡)"], errors="coerce")

0       5841.0
1       5652.0
2       5882.0
3       5721.0
4       5879.0
         ...
4500    3955.0
4501    4039.0
4502    3962.0
4503       NaN
4504    3601.0
Name: 분양가격(㎡), Length: 4505, dtype: float64

In [32]:
# to_numeric()을 사용했는데 int64가 아니고 float64로 변경된 이유는?
import numpy as np
type(np.nan)   # type(pd.np.nan)   동강에서는 이렇게 했는데 이렇게 처리하는게 삭제되었다면서 직접적으로 numpy를 import 하라고 나옴

float

In [33]:
pd.to_numeric?

In [34]:
# 타입을 변경 후 새로운 필드에 담기

df2["분양가격"]= pd.to_numeric( df2["분양가격(㎡)"],errors="coerce")
df2["분양가격"]

0       5841.0
1       5652.0
2       5882.0
3       5721.0
4       5879.0
         ...
4500    3955.0
4501    4039.0
4502    3962.0
4503       NaN
4504    3601.0
Name: 분양가격, Length: 4505, dtype: float64

In [35]:
# 공백을 무시하고 타입을 변환시킨 상태로 아무것도 안들어 있는 값이 존재함

df2["분양가격"].isnull().sum()

396

In [36]:
# 변경된 타입을 가지고 수치 구해 보기

df2["분양가격"].mean()

3260.909467023607

* 공공 데이터 포털에 올라와 있는 2013년 월 ~ 2015년 8월 데이터는 평당분양가격 기준인데 반해 2020년 2월 데이터는 분양가격으로 
* 나와있기 때문에 3.3을 곱해서 "평당분양가격" 컬럼 만들어주기

In [37]:
# 평당분양가격 구하기

df2["평당분양가격"] = (df2["분양가격"] * 3.3)
df2

     지역명               규모구분    연도   월 분양가격(㎡)    분양가격   평당분양가격
0     서울                 전체  2015  10    5841  5841.0  19275.3
1     서울         전용면적 60㎡이하  2015  10    5652  5652.0  18651.6
2     서울   전용면적 60㎡초과 85㎡이하  2015  10    5882  5882.0  19410.6
3     서울  전용면적 85㎡초과 102㎡이하  2015  10    5721  5721.0  18879.3
4     서울        전용면적 102㎡초과  2015  10    5879  5879.0  19400.7
...   ..                ...   ...  ..     ...     ...      ...
4500  제주                 전체  2020   2    3955  3955.0  13051.5
4501  제주         전용면적 60㎡이하  2020   2    4039  4039.0  13328.7
4502  제주   전용면적 60㎡초과 85㎡이하  2020   2    3962  3962.0  13074.6
4503  제주  전용면적 85㎡초과 102㎡이하  2020   2     NaN     NaN      NaN
4504  제주        전용면적 102㎡초과  2020   2    3601  3601.0  11883.3

[4505 rows x 7 columns]

<b>* object로 되어 있었던 분양가격(㎡) 컬럼과 수치로 변환된 분양가격 컬럼 요약해보기</b>

In [41]:
df2["분양가격(㎡)"].describe()

count     4210
unique    1795
top       2221
freq        17
Name: 분양가격(㎡), dtype: object

In [42]:
df2["분양가격"].describe()

count     4109.000000
mean      3260.909467
std       1289.733449
min       1868.000000
25%       2453.000000
50%       2887.000000
75%       3594.000000
max      13835.000000
Name: 분양가격, dtype: float64

<b>* object 타입과 float 타입이 가질 수 있는 기술 통계값은 다름</b>